Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ZeroLengthSegmentWarning
The solution is failing to do segments which are zero length.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ZeroLengthSegmentError
The solution is failing to do segments which are zero length.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.UtilizationCoefficientOutOfRange
The value for Coefficient of Utilization must be between 0 and 1.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.UnableToMakeConnectionInDirection
The application is unable to make a connection in that direction. If the connectors are pointing up, make sure that the elevations of the segments (ducts and pipes) are above them. If the connectors are pointing down, make sure that the elevations of the segments (ducts and pipes) are below them.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SpecifiedAnglesNotCompatibleWithLayoutWarning
The specified angles are not compatible with current layout.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SpecifiedAnglesNotCompatibleWithLayoutError
The specified angles are not compatible with current layout.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SolutionIsOppositeToConnectionWarning
The solution is in the opposite direction of the connection direction.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SolutionIsOppositeToConnectionError
The solution is in the opposite direction of the connection direction.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentsAngleTooGreatWarning
The resulting angle between the segments is too great.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentsAngleTooGreatError
The resulting angle between the segments is too great.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentDrawnFromWrongSideWarning
The segment is being drawn from the wrong side to connect to the location you indicated.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentDrawnFromWrongSideError
The segment is being drawn from the wrong side to connect to the location you indicated.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.OverrideFabricationPartFailed
The fabrication part cannot be overridden. The button code you specified does not match the fabrication service. Please specify a different button code or check the fabrication service and try again.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotEnoughRoomForFittingsWarning
There was not enough room to place the required fittings. Consider increasing the length of the segments,
or moving them farther apart to generate a solution.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotEnoughRoomForFittingsError
There was not enough room to place the required fittings. Consider increasing the length of the segments,
or moving them farther apart to generate a solution.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotAllPartsWereConvertedPlaceholdersWereAddedWarning
Not all parts were converted. Placeholders were added to fill the gaps. Check the fabrication service definition for the system.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotAllPartsWereConvertedCannotAddPlaceholderWarning
Not all parts were converted. Placeholders could not be added to fill the gap (the gap was too small). Check the fabrication service definition for the system.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoValidSolutionAtSelectedPoint
No valid auto-route solution at selected point.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoSolutionInView
There is no solution for this view. All the elements have been filtered for this view, select another view, and select solutions.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingLoadedInProjectError
The fitting that is converted to was not defined. Please load one fitting family and assign it in the routing preference.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingInRoutingError
The fitting that is converted to was not defined. Please assign one in the routing preference.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingInProjectWarning
The routing solution failed because there is no default fitting type specified or the fitting cannot be found in the project.
Ensure the fitting is loaded in the project and try again.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoFittingInProjectError
The routing solution failed because there is no default fitting type specified or the fitting cannot be found in the project.
Ensure the fitting is loaded in the project and try again.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoAutoRouteSolutionFoundWarning
No auto-route solution was found.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoAutoRouteSolutionFoundError
No auto-route solution was found.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.MismatchedSystemTypeWarning
The selected fixture is part of a different system. You may want to edit the system type and merge two systems.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.MismatchedSystemClassificationNoSystemWarning
The selected fixture is assigned to a system with different classification.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.MismatchedSystemClassificationHasSystemWarning
The selected fixture is part of a system with different classification. System calculations (e.g. flow analysis) are not possible between systems with different classifications.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.InappropriateSlopeForPipe
The slope that you specified could not be applied to this pipe. Please check the items that it is connected to and make sure that they aren't constraining the slope of them.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.HighlightedElementDisconnected
The highlighted element has been disconnected.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FittingParamsCauseGeometryToFailWarning
The one of parameters for the fitting is causing the geometry to fail.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FittingParamsCauseGeometryToFailError
The one of parameters for the fitting is causing the geometry to fail.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailedDowngradeTeeToCross
Failed to upgrade tee type to cross type.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailedDowngradeCrossToTee
Failed to downgrade cross type to tee type.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailedDowngradeCrossToElbow
Failed to downgrade tee type to elbow type.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToIntersectParallelSegmentsWarning
The solution is failing to do segments which are parallel and should intersect.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToIntersectParallelSegmentsError
The solution is failing to do segments which are parallel and should intersect.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToDoCompatiblePhaseWarning
The solution is failing to do the elements Phases are compatible.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToDoCompatiblePhaseError
The solution is failing to do the elements Phases are compatible.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ElementHasOpenConnection
This element has an open connection. This may not be an error, but all open connections should be sealed with an end cap.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ElementHasFlowCalculation
This element has an open connection. This may not be an error, but for flow calculations to work correctly all connections should be sealed with an end cap.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.DistributionTypeInvalid
Selected distribution system type is invalid!

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.DesignOptionConflictWarning
The solution is failing to do the elements are not in the same Design Option.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.DesignOptionConflictError
The solution is failing to do the elements are not in the same Design Option.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeWarning
You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeError
You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.

Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures
Failures about AutoRoute.